{
  "description": "Returns fully-hydrated Tweet objects for up to 100 Tweets per request, as specified by comma-separated values passed to the id parameter.\n\nThis method is especially useful to get the details (hydrate) a collection of Tweet IDs.\n\nGET statuses / show / :id is used to retrieve a single Tweet object.\n\nThere are a few things to note when using this method.\n\nYou must be following a protected user to be able to see their most recent Tweets. If you don't follow a protected user their status will be removed.The order of Tweet IDs may not match the order of Tweets in the returned array.If a requested Tweet is unknown or deleted, then that Tweet will not be returned in the results list, unless the map parameter is set to true, in which case it will be returned with a value of null.If none of your lookup criteria matches valid Tweet IDs an empty array will be returned for map=false.You are strongly encouraged to use a POST for larger requests.",
  "doc_url": "https://developer.twitter.com/en/docs/twitter-api/v1/tweets/post-and-engage/api-reference/get-statuses-lookup",
  "parameters": [
    {
      "default value": "",
      "description": "A comma separated list of Tweet IDs, up to 100 are allowed in a single request.",
      "example": "201050118621198921728",
      "name": "id",
      "required": true,
      "type": "Int"
    },
    {
      "default value": "",
      "description": "The entities node that may appear within embedded statuses will not be included when set to false.",
      "example": "false",
      "name": "include_entities",
      "required": false,
      "type": "Boolean"
    },
    {
      "default value": "",
      "description": "When set to either true , t or 1 , each Tweet returned in a timeline will include a user object including only the status authors numerical ID. Omit this parameter to receive the complete user object.",
      "example": "true",
      "name": "trim_user",
      "required": false,
      "type": "Boolean"
    },
    {
      "default value": "",
      "description": "When using the map parameter, Tweets that do not exist or cannot be viewed by the current user will still have their key represented but with an explicitly null value paired with it",
      "example": "true",
      "name": "map",
      "required": false,
      "type": "Boolean"
    },
    {
      "default value": "",
      "description": "If alt text has been added to any attached media entities, this parameter will return an ext_alt_text value in the top-level key for the media entity. If no value has been set, this will be returned as null",
      "example": "true",
      "name": "include_ext_alt_text",
      "required": false,
      "type": "Boolean"
    },
    {
      "default value": "",
      "description": "When set to either true , t or 1 , each Tweet returned will include a card_uri attribute when there is an ads card attached to the Tweet and when that card was attached using the card_uri value.",
      "example": "true",
      "name": "include_card_uri",
      "required": false,
      "type": "Boolean"
    }
  ],
  "type": "Array of Tweets"
}