{
  "description": "Returns a collection of the most recent Tweets and Retweets posted by the authenticating user and the users they follow. The home timeline is central to how most users interact with the Twitter service.\n\nUp to 800 Tweets are obtainable on the home timeline. It is more volatile for users that follow many users or follow users who Tweet frequently.\n\nSee Working with Timelines for instructions on traversing timelines efficiently.",
  "doc_url": "https://developer.twitter.com/en/docs/twitter-api/v1/tweets/timelines/api-reference/get-statuses-home_timeline",
  "parameters": [
    {
      "default value": "",
      "description": "Specifies the number of records to retrieve. Must be less than or equal to 200. Defaults to 20. The value of count is best thought of as a limit to the number of tweets to return because suspended or deleted content is removed after the count has been applied.",
      "example": "5",
      "name": "count",
      "required": false,
      "type": "Int"
    },
    {
      "default value": "",
      "description": "Returns results with an ID greater than (that is, more recent than) the specified ID. There are limits to the number of Tweets which can be accessed through the API. If the limit of Tweets has occured since the since_id, the since_id will be forced to the oldest ID available.",
      "example": "12345",
      "name": "since_id",
      "required": false,
      "type": "Int"
    },
    {
      "default value": "",
      "description": "Returns results with an ID less than (that is, older than) or equal to the specified ID.",
      "example": "54321",
      "name": "max_id",
      "required": false,
      "type": "Int"
    },
    {
      "default value": "",
      "description": "When set to either true , t or 1 , each Tweet returned in a timeline will include a user object including only the status authors numerical ID. Omit this parameter to receive the complete user object.",
      "example": "true",
      "name": "trim_user",
      "required": false,
      "type": "Boolean"
    },
    {
      "default value": "",
      "description": "This parameter will prevent replies from appearing in the returned timeline. Using exclude_replies with the count parameter will mean you will receive up-to count Tweets — this is because the count parameter retrieves that many Tweets before filtering out retweets and replies.",
      "example": "true",
      "name": "exclude_replies",
      "required": false,
      "type": "Boolean"
    },
    {
      "default value": "",
      "description": "The entities node will not be included when set to false.",
      "example": "false",
      "name": "include_entities",
      "required": false,
      "type": "Boolean"
    }
  ],
  "type": "Array of Tweets"
}