{
  "description": "Returns a single Tweet, specified by either a Tweet web URL or the Tweet ID, in an oEmbed-compatible format. The returned HTML snippet will be automatically recognized as an Embedded Tweet when Twitter's widget JavaScript is included on the page.\n\nThe oEmbed endpoint allows customization of the final appearance of an Embedded Tweet by setting the corresponding properties in HTML markup to be interpreted by Twitter's JavaScript bundled with the HTML response by default. The format of the returned markup may change over time as Twitter adds new features or adjusts its Tweet representation.\n\nThe Tweet fallback markup is meant to be cached on your servers for up to the suggested cache lifetime specified in the cache_age.",
  "doc_url": "https://developer.twitter.com/en/docs/twitter-api/v1/tweets/post-and-engage/api-reference/get-statuses-oembed",
  "parameters": [
    {
      "default": "",
      "description": "The URL of the Tweet to be embedded",
      "name": "url",
      "required": true,
      "type": "String"
    },
    {
      "default": "325",
      "description": "The maximum width of a rendered Tweet in whole pixels. A supplied value under or over the allowed range will be returned as the minimum or maximum supported width respectively; the reset width value will be reflected in the returned width property. Note that Twitter does not support the oEmbed maxheight parameter. Tweets are fundamentally text, and are therefore of unpredictable height that cannot be scaled like an image or video. Relatedly, the oEmbed response will not provide a value for height. Implementations that need consistent heights for Tweets should refer to the hide_thread and hide_media parameters below.",
      "name": "maxwidth",
      "required": false,
      "type": "Int [220..550]"
    },
    {
      "default": "false",
      "description": "When set to true, \"t\", or 1 links in a Tweet are not expanded to photo, video, or link previews.",
      "name": "hide_media",
      "required": false,
      "type": "Boolean, String or Int"
    },
    {
      "default": "false",
      "description": "When set to true, \"t\", or 1 a collapsed version of the previous Tweet in a conversation thread will not be displayed when the requested Tweet is in reply to another Tweet.",
      "name": "hide_thread",
      "required": false,
      "type": "Boolean, String or Int"
    },
    {
      "default": "false",
      "description": "When set to true, \"t\", or 1 the <script> responsible for loading widgets.js will not be returned. Your webpages should include their own reference to widgets.js for use across all Twitter widgets including Embedded Tweets.",
      "name": "omit_script",
      "required": false,
      "type": "Boolean, String or Int"
    },
    {
      "default": "none",
      "description": "Specifies whether the embedded Tweet should be floated left, right, or center in the page relative to the parent element.",
      "name": "align",
      "required": false,
      "type": "Enum {left,right,center,none}"
    },
    {
      "default": "",
      "description": "A comma-separated list of Twitter usernames related to your content. This value will be forwarded to Tweet action intents if a viewer chooses to reply, like, or retweet the embedded Tweet.",
      "name": "related",
      "required": false,
      "type": "String"
    },
    {
      "default": "en",
      "description": "Request returned HTML and a rendered Tweet in the specified Twitter language supported by embedded Tweets.",
      "name": "lang",
      "required": false,
      "type": "Enum(Language)"
    },
    {
      "default": "light",
      "description": "When set to dark, the Tweet is displayed with light text over a dark background.",
      "name": "theme",
      "required": false,
      "type": "Enum {light, dark}"
    },
    {
      "default": "",
      "description": "Adjust the color of Tweet text links with a hexadecimal color value.",
      "name": "link_color",
      "required": false,
      "type": "String"
    },
    {
      "default": "",
      "description": "Set to video to return a Twitter Video embed for the given Tweet.",
      "name": "widget_type",
      "required": false,
      "type": "Enum {video}"
    },
    {
      "default": "false",
      "description": "When set to true, the Tweet and its embedded page on your site are not used for purposes that include personalized suggestions and personalized ads.",
      "name": "dnt",
      "required": false,
      "type": "Boolean"
    }
  ],
  "type": "oEmbed Object"
}