{
  "description": "Returns a cursored collection of user objects for users following the specified user.\n\nAt this time, results are ordered with the most recent following first — however, this ordering is subject to unannounced change and eventual consistency issues. Results are given in groups of 20 users and multiple \"pages\" of results can be navigated through using the next_cursor value in subsequent requests. See Using cursors to navigate collections for more information.",
  "doc_url": "https://developer.twitter.com/en/docs/twitter-api/v1/accounts-and-users/follow-search-get-users/api-reference/get-followers-list",
  "parameters": [
    {
      "default value": "",
      "description": "The ID of the user for whom to return results.",
      "example": "12345",
      "name": "user_id",
      "required": false,
      "type": "Int"
    },
    {
      "default value": "",
      "description": "The screen name of the user for whom to return results.",
      "example": "twitterdev",
      "name": "screen_name",
      "required": false,
      "type": "String"
    },
    {
      "default value": "-1",
      "description": "Causes the results to be broken into pages. If no cursor is provided, a value of -1 will be assumed, which is the first \"page.\"The response from the API will include a previous_cursor and next_cursor to allow paging back and forth. See Using cursors to navigate collections for more information.",
      "example": "12893764510938",
      "name": "cursor",
      "required": false,
      "type": "Int"
    },
    {
      "default value": "",
      "description": "The number of users to return per page, up to a maximum of 200. Defaults to 20.",
      "example": "42",
      "name": "count",
      "required": false,
      "type": "Int"
    },
    {
      "default value": "false",
      "description": "When set to either true, t or 1, statuses will not be included in the returned user objects. If set to any other value, statuses will be included.",
      "example": "false",
      "name": "skip_status",
      "required": false,
      "type": "Boolean"
    },
    {
      "default value": "true",
      "description": "The user object entities node will not be included when set to false.",
      "example": "false",
      "name": "include_user_entities",
      "required": false,
      "type": "Boolean"
    }
  ],
  "type": "Cursored Result Object with users Array of User objects"
}