{
  "description": "Returns a single Tweet, specified by the id parameter. The Tweet's author will also be embedded within the Tweet.\n\nSee GET statuses / lookup for getting Tweets in bulk (up to 100 per call). See also Embedded Timelines, Embedded Tweets, and GET statuses/oembed for tools to render Tweets according to Display Requirements.\n\nAbout Geo\n\nIf there is no geotag for a status, then there will be an empty <geo></geo> or \"geo\" : {}. This can only be populated if the user has used the Geotagging API to send a statuses/update.\n\nThe JSON response mostly uses conventions laid out in GeoJSON. The coordinates that Twitter renders are reversed from the GeoJSON specification (GeoJSON specifies a longitude then a latitude, whereas Twitter represents it as a latitude then a longitude), eg: \"geo\": { \"type\":\"Point\", \"coordinates\":[37.78029, -122.39697] }",
  "doc_url": "https://developer.twitter.com/en/docs/twitter-api/v1/tweets/post-and-engage/api-reference/get-statuses-show-id",
  "parameters": [
    {
      "default value": "",
      "description": "The numerical ID of the desired Tweet.",
      "example": "123",
      "name": "id",
      "required": true,
      "type": "Int"
    },
    {
      "default value": "",
      "description": "When set to either true , t or 1 , each Tweet returned in a timeline will include a user object including only the status authors numerical ID. Omit this parameter to receive the complete user object.",
      "example": "true",
      "name": "trim_user",
      "required": false,
      "type": "Boolean"
    },
    {
      "default value": "",
      "description": "When set to either true , t or 1 , any Tweets returned that have been retweeted by the authenticating user will include an additional current_user_retweet node, containing the ID of the source status for the retweet.",
      "example": "true",
      "name": "include_my_retweet",
      "required": false,
      "type": "Boolean"
    },
    {
      "default value": "",
      "description": "The entities node will not be included when set to false.",
      "example": "false",
      "name": "include_entities",
      "required": false,
      "type": "Boolean"
    },
    {
      "default value": "",
      "description": "If alt text has been added to any attached media entities, this parameter will return an ext_alt_text value in the top-level key for the media entity. If no value has been set, this will be returned as null",
      "example": "true",
      "name": "include_ext_alt_text",
      "required": false,
      "type": "Boolean"
    },
    {
      "default value": "",
      "description": "When set to either true , t or 1 , the retrieved Tweet will include a card_uri attribute when there is an ads card attached to the Tweet and when that card was attached using the card_uri value.",
      "example": "true",
      "name": "include_card_uri",
      "required": false,
      "type": "Boolean"
    }
  ],
  "type": "Tweet"
}